Autodesk.Revit.DB.ExternalResourceLoadStatus
A flag to indicate the status of an ExternalResource load request.
Remarks:
This flag is returned by the LoadResource method of the IExternalResourceServer
class to inform callers whether the load operation succeeded, or encountered
an error.

Autodesk.Revit.DB.ExternalResourceLoadStatus.ServerThrewException
The server identified by the ExternalResourceReference threw an exception while attempting to load a resource.

Autodesk.Revit.DB.ExternalResourceLoadStatus.CannotFindServer
The server identified by the ExternalResourceReference could not be found, and may not be registered.

Autodesk.Revit.DB.ExternalResourceLoadStatus.ResourceAlreadyCurrent
The current version of the resource is already loaded into Revit so no changes were made to the model.

Autodesk.Revit.DB.ExternalResourceLoadStatus.Uninitialized
The load operation is in an incomplete state.
Revit will treat this result as a failure.

Autodesk.Revit.DB.ExternalResourceLoadStatus.Failure
The load operation failed.

Autodesk.Revit.DB.ExternalResourceLoadStatus.Success
The load operation was successful.